spmckeon1/EmbeddedInfrastructure/old_src/commonItems_ESP32.cpp
/*
 * Apr  06,2025 - Moved Update.onProgress(printProgress) from the apps .ino file to commonItems_ESP32.cpp.  This makes one less item
 *                  that has to be in every apps .ino file
 * Mar  19,2025 - changed sendMQTT_aliveMsgs to sendNrAliveMsgs
 * Jan  01,2023 - Modified setUpEZTime() to allow five attempts at setting the time and if they all fail to then reboot.
 *                 Disabled EzTime events() as it seems to be crashing the program
 *
 *                suli = subtract unsigned long int
 *
 * Mar 31, 2025 - commonItemsFileSysStartup() needs to be added to new apps right after the call to start the file system
                    has been loaded and before other application start fioe system actions occur, eg, startSD(),
                    LittleFS.begin.
 * jun 10, 2024 - moved generateAppData() from the app.ino file to commonItems_ESP32.cpp to enable a more common use of it 
                    across apps.
 *                In the app.h file the definition of:
 *                  #define COMPILE_DATE __DATE__ " " __TIME__
 *                    needs to be changed to:
 *                #define COMPILE_DATE String(__DATE__ " " __TIME__)
 *              - Removed 'doTempStartUp()' to allow the app to choose to use DHT or DS18B20 temperature sensors.
 *                doTempStartUp() will now have to be called from the application startup routine.
 *
 * jul  6, 1024-  Added code to allow the ESP device to be an access point for a pre-determined time (10 minutes at this time)
 *                  and then it will initiate a reboot.  The intent is that if it connect connect to the desired network it
 *                  will try again every 10 minutes.
 * sep  04, 2024 - Added IP address to then String generateAppData() sends out.
 * Jan  30, 2025 - replaced splitString() with strToArray() (moved to myText.cpp) to eliminate a memory leak.
 *                 NOTE: mqttSetup() has been moved to commonItems_ESP32.cpp in commonItemsStartup().  This used to in the 
 *                       apps main.ino file.  Please remove it.
 * Apr  01, 2025 - decremented the below procedures.  These were implemented when the libraries were first created and
 *                  were believed to be useful but in truth have never been used.  Please delete them from anything that
 *                  uses these libraries.
 *                      bool addNewClientToList(AsyncWebSocketClient * client, String type, String CUID);
 *                      String printListOfConnectedClients();
 *                      int getUnusedClientIndex();
 *                      String findClientsByType(String type);
 *                      int findClientIndex(int id, bool logErr);
 *                      findClientByCUIDint findClientByCUID(String CUID, bool adviseOnResults);
 * Apr  10, 2025 -  Added a int parameter to doTempStartUp().  This will set the DS20B18's temp resolution.  This must be a
 *                    number between between 9 and 12 inclusively.
 * May  19, 2025 -  Moved 'tempSenActNeeded()' from commonItemsEvents() to ds18b20Events() in the myTemperature.cpp file to 
 *                    enable app not using DS18B20 temp sensors to compile without errors.
 * jun  10, 2025 -  Moved mqttSetup() from commonItems_ESP32 to myMQTT.cpp.
 * Nov  14, 2025 -  Added:
 *                    createDirIfNotExist(FS_IN_USE, HTMLFsDir)
 *                    to commonItemsFileSysStartup() to ensure the /html directory is created.  This was previously
 *                    taken care of in the application main file but makes more sense in the CommonItems_ESP32 file.
 *                    This can now be removed from the app main file but will do no damge of lert.
*/

#include <ArduinoTrace.h>
#include <AsyncWebSocket.h>

#include <myStuff.h>
#include <myMQTT.h> 
#include <myOTA_update.h>
#include <myText.h>
#include <commonItems_ESP32.h>

String startUpBootLogStr = "";                                                  // string to hold initial log info until the file system is mounted

short CK_HEAP_INTERVAL = 60;                                                    // once an hour
long lastFreeHeap = 0;                                                          // what was the free heap when last checked
unsigned long lastHeapRun = 0;                                                  // last millisecond count the heap was checked
const String dirLists = "/dirLists";                                            // directory on disk for files with folder contents in them

bool  timeActive = false;                                                       // the ESP has a good clock, set to true when connected to a time server

const String compile_date = __DATE__ " " __TIME__;                              // date and time the compiler ran

String tmpBootSyslog = "/tBSyslog.txt";                                         // temporary boot syslog file
String connectedSSID = "";                                                      // what ssid is the ESP connected to
String srvIPAddr = "";                                                          // holds the ip address of the server
String accessPtIP = "";                                                         // holds the server IP Address when it is acting as an access point
String downloadLoc = "";                                                        // contains the path to add to file downloads from clients
String serverUptime = UPTIME;                                                   // how long since the server came on lime
const String appDir = "/appData";                                               // name of the app directory
const String HTMLFsDir = "/html";                                               // file directory for HTML page files
const String rebootReason = appDir + "/rebootreason.txt";                        // stores the reason when the app initiates a reboot
const String lastBootTimeFname = "/bootTime";                                   // UNIX time the server last booted

unsigned long rebootAskedforAt = 0;                                             // milliseconds reboot was asked for at
unsigned long lastRebootUpdate = 0;                                             // keep track of the milliseconds when a reboot update is done
unsigned long timeTimeSyncLost = 0;                                             // milliseconds since boot the the EZTime time sync was lost
int whereToSendLogEntryTo = BOOT_LOG_STR;                                       // where should the log entries get posted...always to BOOT_LOG_STR on boot
int MQTT_testmsgFreq = 60000;                                                   // MQTT test msg frequency time

bool rebooting = false;                                                         // are we counting down for a reboot
bool downloadingFile = false;                                                   // javascript 'fetch()' is downloading a file...need not to run any 'DallasTemperature' routines while downloading
bool doTx_debug = true;                                                         // turn on EasyTz debugging
bool bootChg = false;                                                           // have the boot wifi credentials been changed
bool tzChange = false;                                                          // has the desired timezone changed
bool startEzTime = false;                                                       // gets set to true when set up ezTime needs to be run
bool startMQTT = false;                                                         // gets set to true when the MQTT server needs to be connected to
bool mqttRunning = false;                                                       // mqtt is up and running
bool logToMQTTServer = false;                                                   // move temp logs to the MQTT server and start doing all logs to the MQTT server
bool mqttDownLogF = false;                                                      // when mqtt goes down this signals action to syslog writer
bool heapDebugging = false;                                                     // is the app in a heap debugging more
bool needBootTime = true;                                                       // need to get the get the servers boot time

