spmckeon1/EmbeddedInfrastructure/old_src/commonItems_ESP32.cpp
size_t content_len = 0;                                                         // used in OTA updates

const String allDirectoriesToFile = dirLists + "/allDirs1Deep.txt";             // file to contains all the directories needed for update.html to work

AsyncWebServer server(80);                                                      // server port 80
Timezone myTZ;                                                                  // declare the ezTime TimeZone object;
AsyncWebSocket ws("/ws");                                                       // declare the asyncWebSocket object
timeStatus_t ezT_status = timeStatus();                                         // declare ezTime status and put the current status in it

int clientIdsInUse [MAX_NUM_CONNECTED_CLIENTS] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0};// connected clients that are in use will be changed to a 1
int numOfConnectedClients = 0;                                                  // number of active connected clients
ConnectedClients connectedClients[MAX_NUM_CONNECTED_CLIENTS];                   // an array, MAX_NUM_CONNECTED_CLIENTS long, that hold connected client info
/*---------------    EZTIME - TIMESTATUS WORDS   ---------------*/

String getTimeStatusWords(int tStatus) {
  switch(tStatus) {
    case 0 : return F("timeNotSet");
      break;
    case 1 : return F("timeNeedsSync");
      break;
    case 2 : return F("timeSet");
      break;
    default : return("An unknown time status has been received, '" + String(tStatus) + "'.  Please advise the developer of this server.\n");
  }
}

/*---------------    IS TIME GOOD   ---------------*/

bool isTimeGood() {
  static unsigned long t = millis();                                            // init 't' to the current clock milliseconds
  if(millis() - t > 2000) {                                                     // if it has been more than 2 seconds since this last ran
    t = millis();                                                               // rest 't' tp the current milliseconds
    if(connectedSSID == "accessPt") return true;                                // if the server is providing an access point then just return true
    bool result = true;                                                         // create result and init it to true
    return result;
    t = millis();
  }
  return true;
}

/*---------------   GET WHERE SYSLOG IS BEING WRITTEN TO   ---------------*/

String syslogLocName(int x) {
  switch(x) {
    case BOOT_LOG_STR:
      return BOOT_LOG_FILE_NAME;
      break;
    case BOOT_LOG_FILE:
      return BOOT_LOG_FILE_NAME;
      break;
    case MQTT_SERVER:
      return MQTT_SERVER_NAME;
      break;
    case OFFLINE_DISK_FALLBACK:
      return OFFLINE_DISK_FALLBACK_NAME;
      break;
    default:
      mySP("The syslog is going to an unknown location, please case this to be fixed.\n", FN, LN);
      return String(x);
  }
}

/*---------------    COMMON FILE SYSTEM STARTUP ACTIONS   ---------------*/

void commonItemsFileSysStartup() {
  
  myFileSys.createDirIfNotExist(appDir);                                       // ensure each of the directories needed exist n the SD
  myFileSys.createDirIfNotExist(dirLists);                                     // make sure the dir list directory exists
  myFileSys.createDirIfNotExist(HTMLFsDir);                                    // make sure the html directory exists
  myFileSys.ensureFileExists(allDirectoriesToFile.c_str(), DIRS_IN_USE, LN);         // used by the update page to know what directories to advertise
  myFileSys.ensureFileExists(lastBootTimeFname.c_str(), "", LN);                     // if the boot file time file does not exist then create it as an empty file
  myFileSys.ensureFileExists(UPD_HTML_FILE.c_str(), "", LN);                         // if the firmware update file does not exist then log the action needed
  if(myFileSys.ensureFileExistsLazy(netInfoFname, []() {
    String out; LogInDataToStr(out, logInDataPtr, true);
    return out;}, LN) == FILE_ALREADY_EXISTS) {
      readNetInfoFromDisk(netInfoFname);
  }
}

/*---------------    DO ANY MYSTUFF2 SETUP TASKS   ---------------*/

void commonItemsStartup()  {
  TRACE();
  bool WiFiSuccess = false;
  #ifdef ESP32                                                                  // if this is running in an ESP32 set printProgress() up as the update progress routine
    Update.onProgress(printProgress);
  #endif
  mqttSetup(mqttHostPtr);
  wifi_setup();                                                                 // setup Wi-Fi
  WiFiSuccess = connToWiFi(logInD1.ssid, logInD1.ssidPwd, LN);                  // connect to wifi
  if(myFileSys.getFS().exists(rebootReason)) {                                  // if the file exists
    mySP("REASON FOR THE LAST REBOOT WAS: " + myFileSys.readFile(               // read it and write its contents to the log
         rebootReason.c_str(), false) + "\n", FN, LN);
    myFileSys.deleteFile(rebootReason.c_str(), LN);                             // and then delete the file
  } else mySP("ERROR: NO BOOT REASON FILE EXISTS.\n", FN, LN);
}

/*---------------    GET SERVER UP TIME   ---------------*/

String getServerUptime() {
  if(needBootTime) return msToDHMS(millis());                                   // if the server does not have the time yet just us milliseconds
  String s = myFileSys.readFile(lastBootTimeFname.c_str(),false);              // read the start time from disk
  time_t t = s.toInt();
  t = suli(myTZ.now(), t, LN, true);                                                      // get the elapsed seconds between boot and now
  return msToCommaSepDHMS(t * 1000, ',', true);                                 // convert the UNIX time in ms to DHMS
}

/*---------------    GET BOOT TIME SECONDS   ---------------*/

time_t getBootSeconds() {
  return myFileSys.readFile(lastBootTimeFname.c_str(),false).toInt();          // read and return the start time from disk
}

/*---------------    GET BOOT TIME   ---------------*/

void saveBootTime() {
  needBootTime = false;

  time_t bootT = myTZ.now() - (millis() / 1000);                                // get the actual boot time
  int success = myFileSys.writeFile(lastBootTimeFname.c_str(), String(bootT).c_str(), LN);
  
  mySP("Wrote the boot time of " + String(bootT) + " to the file " +
       lastBootTimeFname + ".\n", FN, LN);
}

/*---------------    DO COMMON ITEMS LOOP TASKS   ---------------*/

void commonItemsEvents() {
  static unsigned long t = millis();                                            // declare a static time var
  static unsigned long t2 = 0;                                                  // declare a static time var - #2]
  static runTime hbTimer = {30, 0, CT_SECOND};                                  // Static variable retains its state across loop iterations
  static uint32_t lastMqttConnectAttempt = LAST_MQTT_CONNECT_ATTEMPT;           // set to a -10 seconds to allow first pass to happen immediately on boot

  static runTime upTime = {1, -1, CT_MINUTE};                                   // update the run time every minute
  t = millis();                                                                 // put the current milliseconds in it every time through the loop
  
  if(needBootTime &&
       !booting &&                                    // Wait until MQTT connection steps settle completely
       myTZ.getPosix() != "UTC" &&
       myTZ.getPosix().length() > 0 &&
       timeStatus() == EZT_TIME_SET) {
      
      needBootTime = false;                           // Clear the flag IMMEDIATELY before starting the 136ms flash write
      mySP("SETTING BOOT EPOCH TIME.\n", FN, LN);
      saveBootTime();                                 // Safe to block for 136ms now!
    }

  if(WiFi.status() != WL_CONNECTED  && !AP_createdTime) {                       // if the wifi is disconnected try to reconnect it and the server is not in an Access Point mode
    mySP("WiFi.status() returned WL NOT CONNECTED\n", FN, LN);                  // log the issue
    connectToWiFi(LN);
  }
  
  if(isTimeToRun(&upTime)) {
    String str = msToCommaSepDHMS(millis(), ':', false);;
    sendWS_msg(FN, "uptime:" + str.substring(0, str.lastIndexOf(":")), NULL);   // send the current uptime to all the web clients
    mqttPublishMsg(serverUptime, 2, false,                                      // send the uptime to node red
                   str.substring(0, str.lastIndexOf(":")), LN);
    return;
  }
  
  if(AP_createdTime && suli(t, AP_createdTime, LN, true) > MAX_TIME_AS_ACCESS_PT) {       // if the ESP is acting like an access point and it has been doing this for longer than desired
    requestReboot(MAX_AP_TIME_REACHED, true);                                             // request the server reboot
    return;
  }
  
  if(!connectedToMQTT) {
    if (millis() - lastMqttConnectAttempt > MQTT_RETRY_DELAY_LEN) {
      lastMqttConnectAttempt = millis();
      mySP("MQTT Trigger Gate Active. Forwarding execution to connectToMqtt().\n", FN, LN);
      connectToMqtt();
      return; // Always drop out cleanly to prevent background code race conditions!
    }
  }

  // --- FIXED TIMING STATE MACHINE ---
  if(startEzTime) {
    setUpEZTime(logInD1.olsenTzName);
    
