spmckeon1/EmbeddedInfrastructure/old_src/commonItems_ESP32.cpp
    // Clear the flag ONLY once setUpEZTime successfully binds our clock system.
    // This allows subsequent tasks down below to continue executing while network sync is pending!
    if (timeActive) {
      startEzTime = false;
    }
    return;
  }
  
  if(logToMQTTServer) {
    moveBootLogsToSyslog();
    mySP("********** The " + constData.appName + " is now fully up and running. **********\n", FN, LN);
    return;
  }
  
  if(tzChange) {                                                              // if a Tz change is needed
    static unsigned long lastTzAttempt = 0;
    if (suli(millis(), lastTzAttempt, LN, true) > 10000) {                    // if 10 seconds since the last time
      lastTzAttempt = millis();                                               // remember when
      
      mySP("tzChange is TRUE. Executing timezone update attempt.\n", FN, LN); // log the attempt
      setUpEZTime(logInD1.olsenTzName);                                       // set the time
      return;                                                                 // Drops out cleanly, but ONLY once every 10 seconds!
    }                                                                         // bad timimg and going on to other things
  }
  if (timeStatus() != EZT_TIME_SET && connectedSSID != "accessPt") {            // if the EZTime admits the time is not currently set
    mySP("EZTime status has been found to be '" + String(timeStatus())          // log the issue
         + "' instead of 'timeSet'. Initiating new EZTime setup.\n", FN, LN);
    setUpEZTime(logInD1.olsenTzName);                                           // and attempt to reset it
    return;                                                                     // only do one thing so the watchdog timer does not get tripped
  }
  
  if (rebooting) {                                                              // if the ESP is getting ready to reboot
    if (t - lastRebootUpdate > 1000) {                                          // if it has been 1 second since last time
      serverRebootInProgress();                                                 // call serverRebootInProgress to do any needed updates
      return;                                                                   // only do one thing so the watchdog timer does not get tripped
    }
  }
  if(sendNrAliveMsgs && suli(millis(),lastNrAliveMsgSent, LN, true) > MQTT_testmsgFreq) { // if MQTT alive test msg are being sent and it is time to do one then
    sendMqttAliveMsg();                                                         // send an alive msg
    lastNrAliveMsgSent = millis();                                              // remember the last time this ran
    return;                                                                     // only do one thing so the watchdog timer does not get tripped
  }
  
  if(sendNrAliveMsgs && suli(millis(),lastMqttAliveMsgRcv, LN, true) > aliveMsgWaitTimeout) {      // if it has been too long since the last alive msg from mode red
    hdlOverdueNR_aliveMsg();                                                    // handle the issue
    return;                                                                     // only do one thing so the watchdog timer does not get tripped
  }
  if(connectedToMQTT && mqttHbActive && isTimeToRun(&hbTimer)) {
    runMqttHeartbeat();
  }
    
  events();                                                                     // call the EzTime background polling loop
}

/*---------------    PRINT DASHED SEPARATOR LINE   ID 103---------------*/

String pdl(String callingFunct, int origLineNo)  {
  return callingFunct +":" + "LINE:" + String(origLineNo) + " ----------------------------------------------\n";
}

/*---------------    CUSTOMIZED INFO DISSEMINATION SEND A MESSAGE TO THE WEB PAGES CONSOLE  ---------------*
   Requires a ESPAsyncWebServer AsyncWebSocket 'ws' variable exist
   if it is desired to just have the incoming 's' sent to the serial port, 'who' should be -1 and line number may be anything.
   if it is desired to be sent to the serial port and all the connected web pages then who should be defined in the 'getSendToConsoleWho()'
   function and 'lineNo should be the line number of the callomh code line number.  This is usually 'LN'.
   if not who = -1 and 'NOTIME' does not exist in the incoming 's', then 's' is written to the serial port and all connected web pages with
   out any current time information.

*/

void sendWS_msg(String callingF_name, String s, AsyncWebSocketClient *client) {
  if (client != NULL) {                                                 // if the client is not null then
    client->text(s);                                                    // send it to the client
  } else {
    ws.textAll(s);                                                      // else send it to all the clients
  }
}

/*---------------  DUMP OFFLINE RAM LOGS TO MQTT HOST  ---------------*/

void dumpRamLogsToMqtt() {
  if (!connectedToMQTT) return; // Guard clause: abort if network isn't ready
  
  mySP("MQTT Link recovered! Extracting offline RAM cache memory to server...\n", FN, LN);

  // 1. If the wheel has wrapped, read from the current index pointer to the end first (oldest data)
  if (ramLogWrapped) {
    for (int i = ramLogIndex; i < MAX_RAM_LINES; i++) {
      if (ramLog[i][0] != '\0') {
        mqttPublishMsg(MQTT_IN_SYSLOG, 0, false, ramLog[i], LN);        delay(5); // Tiny 5ms delay to prevent flooding your network TX buffer arrays
      }
    }
  }

  // 2. Then read from slot 0 up to the current index pointer (newest data)
  for (int i = 0; i < ramLogIndex; i++) {
    if (ramLog[i][0] != '\0') {
      mqttPublishMsg(MQTT_IN_SYSLOG, 0, false, ramLog[i], LN);      delay(5);
    }
  }

  // 3. Clear the slate completely so we don't send duplicate reports later
  ramLogIndex = 0;
  ramLogWrapped = false;
  memset(ramLog, 0, MAX_RAM_LINES * MAX_LOG_LINE_LEN);      // Fast zero out memory dump
  mySP("RAM cache successfully cleared. System synchronized.\n", FN, LN);
}

/*---------------    CUSTOMIZED SERIAL.PRINT   ID 102---------------*/

void recordToRamLog(String s) {
  // Bounded safe copy: extracts string data directly into our static row array slot
  snprintf(ramLog[ramLogIndex], MAX_LOG_LINE_LEN, "%s", s.c_str());
  
  ramLogIndex++; // Move the pointer to the next slot row
  
  // If the hand hits the top of the clock, rotate back to the zero slot
  if (ramLogIndex >= MAX_RAM_LINES) {
    ramLogIndex = 0;
    ramLogWrapped = true; // The wheel has full history now
  }
}

/*---------------    GET LOG TIME STAMP  ---------------*/

String getLogTimeStamp() {
  if (!timeActive)  {                             // if not 'timeActive' then
    return String(millis()) + "ms";               // put the milliseconds into 't'
  } else return MY_TIME_F;                        // else put the current time into 't'
 
