spmckeon1/EmbeddedInfrastructure/old_src/commonItems_ESP32.cpp
}
   
/*---------------    FORMAT LOG ENTRY FOR THE SERIAL MONITOR  ---------------*/
   
String doSerialMonLogEntry(String event, String functionName, int lineNo) {
  return getLogTimeStamp()+                     //return the log entry
         ", Line#:" + String(lineNo)
         + ", FROM: " + functionName +
         ": " + event;
}

/*---------------    FORMAT LOG ENTRY AS JSON STRING  ---------------*/

String doJsonStrLogEntry(String event, String functionName, int lineNo) {
  static uint32_t devSeq = 1;
  
  JsonDocument doc;
  
  doc["deviceSequence"] = devSeq++;                    // load in the sequence number
  doc["eventTime"]      = getLogTimeStamp();           // load the now time stamp
  doc["component"]      = constData.appShortName;      // load the app short name
  doc["function"]       = functionName;                // load the function name
  doc["line"]           = lineNo;                      // load the code line number
  doc["message"]        = event;                       // load the event

  String json;
  serializeJson(doc, json);
  return json + "\n";
}

/*---------------    CUSTOMIZED SERIAL.PRINT   ID 102---------------*/

void mySP(String event, String functionName, int lineNo) {
  Serial.print(doSerialMonLogEntry(event, functionName, lineNo));
  sendToSyslog(doJsonStrLogEntry(event, functionName, lineNo));
}

/*---------------    CUSTOMIZED SERIAL.PRINT   ID 102---------------*

void mySP(String s, String who, int lineNo) {
  if(who == "-1" && lineNo == -1) {
    Serial.print(s);                                                  // send 's' to the serial monitor
    sendToSyslog(s);
    return;
  }
  if (who == "-1") {                                                  // if just the incoming string is wanted to be sent to the serial port
    Serial.print(s);                                                  // send 's' to the serial monitor
    return;
  }
  String t = "";                                                      // declare a string to hold the time
  if (!timeActive)  {                                                 // if not 'timeActive' then
    t = String(millis()) + "ms";                                      // put the milliseconds into 't'
  } else t = MY_TIME_F;                                               // else put the current time into 't'
  s = t + ", Line#:" + String(lineNo) + ", FROM: " + who + ": " + s;  // build the string to send
  Serial.print(s);                                                    // send it to the Serial monitor
  sendToSyslog(s);                                                    // send it to the syslog
}

/*---------------    WRITE TO SYSLOG   ID 141---------------*/

void sendToSyslog(String s) {
  switch(whereToSendLogEntryTo) {
    case BOOT_LOG_STR:
      startUpBootLogStr += s;
      break;
      
    case BOOT_LOG_FILE:
      myFileSys.appendFile(tmpBootSyslog.c_str(), s.c_str());
      break;
      
    case MQTT_SERVER:
      if (connectedToMQTT) {
        mqttPublishMsg(MQTT_IN_SYSLOG, 0, false, s, LN);
      } else {
        // 🛡️ NETWORK DROP FALLBACK: If MQTT drops, roll it into RAM instead of flash disk!
        recordToRamLog(s);
      }
      break;
    case OFFLINE_DISK_FALLBACK: // Your name-corrected network outage fallback slot
      // 🛡️ NO-DISK SHIELD: Divert high-traffic offline logs straight to RAM
      recordToRamLog(s);
      break;
      
    default:
      Serial.print("Received an unknown code for where to send the syslog entry. Code: " + String(whereToSendLogEntryTo) + "\n");
      break;
  }
}

/*---------------  BEGIN SERIAL  ID 103---------------*/

void beginSerialConnection()  {
  Serial.begin(115200);                                                         // set the serial port speed
  pdl(FN, LN);                                                                  // print a separator line
  Serial.println("");                                                           // move to a new line in the Serial monitor window
  mySP("Serial started at 115200\n", FN, LN);                                   // announce the serial process has been started
  pdl(FN, LN);                                                                  // print a separator line
}

/*---------------  MOVE THE LOGS THAT HAVE BEEN COLLECTED SINCE BOOT TO THE SYSLOG  ---------------*/

void moveBootLogsToSyslog() {
  if (!myFileSys.getFS().exists(tmpBootSyslog)) {
    mySP("ERROR:There was no '" + tmpBootSyslog +
              "' file to move to today's " +                                                  // log there was no temp boot file to work with
              "syslog file. This was n=unexpected.\n", FN, LN);
    return;
  }
  File f = myFileSys.getFS().open(tmpBootSyslog, "r");
                                                                                // if the tmpBootSyslog.txt' does exists
  if (!f) {
    mySP("Failed to open '" + tmpBootSyslog + "'.\n", FN, LN);
    logToMQTTServer = false;
    return;
  }
  int size = f.size();
  while(f.available()) {
    String line = f.readStringUntil('\n');
    if (line.length() == 0) continue;
    Serial.println(line);
    mqttPublishMsg(MQTT_IN_SYSLOG, 1, false, line, LN);
    delay(5);
  }
  f.close();
  whereToSendLogEntryTo = MQTT_SERVER;                                                          // the boot log file has been written to the MQTT server so start sending all logs there
  mySP("Sending logs to: " + syslogLocName(whereToSendLogEntryTo) + "\n", FN, LN);              // log where syslog files are going
  mqttDownLogF = false;                                                                         // mqtt is no longer down so make this false
  mySP("Sent "+String(size)+" bytes from "+tmpBootSyslog+" To the MQTT server log\n",FN,LN);    // log the action
  myFileSys.deleteFile(tmpBootSyslog.c_str(), LN);                                              // delete the temp boot file
  logToMQTTServer = false;
}

/*
 if (myFileSys.getFS().exists(tmpBootSyslog)) {                                                            // if the tmpBootSyslog.txt' does exists
   String s = myFileSys.readFile(tmpBootSyslog.c_str(), false);                                   // pull the data out of the temp boot file
   if (s != "")  {                                                                                 // if 's' is not an empty string
     int size = myFileSys.getFileSize(tmpBootSyslog.c_str());                                       // get the file size of tmpBootSyslog
     mqttPublishMsg(MQTT_IN_SYSLOG, 1, false, s, LN);                                              // send the file contents to the MQTT server
     whereToSendLogEntryTo = MQTT_SERVER;                                                          // the boot log file has been written to the MQTT server so start sending all logs there
     mySP("Sending logs to: " + syslogLocName(whereToSendLogEntryTo) + "\n", FN, LN);              // log where syslog files are going
     mqttDownLogF = false;                                                                         // mqtt is no longer down so make this false
     mySP("Sent "+String(size)+" bytes from "+tmpBootSyslog+" To the MQTT server log\n",FN,LN);      // log the action
     myFileSys.deleteFile(tmpBootSyslog.c_str(), LN);                                             // delete the temp boot file
   } else mySP("Failed to move the boot log into the syslog file.\n", FN, LN);                     // else the process failed
 } else mySP("There was no '" + tmpBootSyslog + "' file to move to today's " +                     // log there was no temp boot file to work with
             "syslog file.\n", FN, LN);
 logToMQTTServer = false;

 */
/*---------------  SETUP EZTIME TO GIVE US TIME  ID 107---------------*/

