spmckeon1/EmbeddedInfrastructure/old_src/commonItems_ESP32.cpp
void setUpEZTime(String olsenName) {
  static time_t lastPass = 0;
  // Quickly skip if called too soon (at most once every 5 seconds)
  if(suli(millis(), lastPass, LN, true) < 5000) return;
  lastPass = millis();
  
  if (timeStatus() != timeSet) {                                                // if the timeStatus does not match timeSet
    mySP("Waiting for background NTP sync packet...\n", FN, LN);                // the system is waiting to receive a NTP packet
    updateNTP();                                                                // fires a UDP data packet at the NTP server and returns instantly
    return;                                                                     // and go around again
  }
  
  timeActive = true;                                                            // NTP IS SET so Evaluate the timezone resolution pipeline
  
  // ==========================================================================
  // PIPELINE STATE 1: LOCAL POSIX RULE MATCH
  // ==========================================================================
  if (logInD1.posixTzRule.length() > 0) {                                       // there is a local profile so use it
    mySP("NTP synced. Applying local POSIX rule instantly: " +                  // log the data
         logInD1.posixTzRule + "\n", FN, LN);
    bool tzSet = myTZ.setPosix(logInD1.posixTzRule);                            // set the tz using the POSIX data
    if (tzSet) {                                                                // if the call succeeded
      mySP("Successfully locked local timezone via POSIX rule.\n", FN, LN);     // log this
      
      // --- LANDING ZONE 1: POSIX SUCCESS ---
      startEzTime = false;                                                      // don't need to come back so turn the flag off
      tzChange = false;                                                         // consume user requested timezone change token successfully
      
      doAppTimeIsSetActions();                                                  // if the app has anything it needs to do when the time is set call them
      return;                                                                   // all finished so return
    }
  }
  
  // ==========================================================================
   // PIPELINE STATE 2: OLSON LOOKUP FALLBACK
   // ==========================================================================
   if (olsenName.length() > 0) {
     mySP("POSIX blank. Resolving timezone via Olson Name: " + olsenName + "\n", FN, LN);
     
     if (myTZ.setLocation(olsenName)) {
       String freshPOSIX = myTZ.getPosix(); // Capture what the server sent back
       
       // 🛡️ FLASH PRESERVATION: Only write if the rule is actually different!
       if (logInD1.posixTzRule != freshPOSIX) {
         logInD1.posixTzRule = freshPOSIX;
         writeNetInfoToDisk(netInfoFname);
         mySP("POSIX changed! Committed updated JSON payload directly to /netInfo.txt\n", FN, LN);
       } else {
         mySP("POSIX rule matches current disk file. Skipping redundant flash write.\n", FN, LN);
       }
       
       // --- SUCCESS: Turn the flags off permanently! ---
       startEzTime = false;
       tzChange = false;
       
       doAppTimeIsSetActions();
       return;
     } else {
       mySP("Olson lookup failed. Retrying in 10 seconds via loop timer...\n", FN, LN);
       return;
     }
   }
  // ==========================================================================
  // PIPELINE STATE 3: HARD FAILURE fallback
  // ==========================================================================
  mySP("WARNING: Timezone profile missing or corrupt. Forcing Central Time fallback.\n", FN, LN); // log the issue
  logInD1.posixTzRule = "CST6CDT,M3.2.0,M11.1.0";                               // Both POSIX and Olson are missing or totally corrupt - using default settings
  myTZ.setPosix(logInD1.posixTzRule);                                           // set the time
  
  // --- LANDING ZONE 3: FALLBACK SUCCESS ---
  startEzTime = false;                                                          // don't need to come back so turn the flag off
  tzChange = false;                                                             // consume user requested timezone change token successfully
  
  doAppTimeIsSetActions();                                                      // if the app has anything it needs to do when the time is set call them
}

/*---------------  IS IT TIME TO RUN A PROCESS  AT A DA, HOUR, MINUTE, OR SECOND INTERVAL  ---------------*/

bool isTimeToRun(runTimePtr when) {
  int d = DAY.toInt();
  int h = HOUR.toInt();                                       // get the current hour
  int m = MINUTE.toInt();                                     // get the current minute and convert it to an int
  int s = SEC.toInt();                                        // get the current second
  int t = (h*60) + m;                                         // minutes since midnight
  int sd = (m * 60) + s;                                      // number of seconds elapsed in the hour
  switch(when->type){
    case CT_DAY:
      if(d % when->intvToRun == 0 && d != when->lastRun) {    // if this is the day interval and this day has not been done
        when->lastRun = d;
        return true;
      }
      break;
    case CT_HOUR:
      if(h % when->intvToRun == 0 && h != when->lastRun) {    // if this is the hour interval and this hour has not been done
        when->lastRun = h;
        return true;
      }
      break;
    case CT_MINUTE:
      if(t % when->intvToRun == 0 && t != when->lastRun) {    // if this is the minute interval and this minute has not been done
        when->lastRun = t;
        return true;
      }
      break;
    case CT_SECOND:
      if(sd % when->intvToRun == 0 && sd != when->lastRun) {  // if this is the second interval and this second has not been done
        when->lastRun = sd;
        return true;
      }
      break;
  }
  return false;                                               // if it made it this far then return false
}

/*---------------  MINUTE STRING TO INT  ---------------*/

int minuteToInt() {
  String min =  MINUTE;                                                         // get the clock minute time field
  return min.toInt();                                                           // convert it to an integer and return it
}

