spmckeon1/EmbeddedInfrastructure/old_src/commonItems_ESP32.cpp
/*---------------  SECOND STRING TO INT  ---------------*/

int secondToInt() {
  String sec =  SEC;                                                            // get the clock minute time field
  return sec.toInt();                                                           // convert it to an integer and return it
}

/*---------------    GET LOG TIME   ID 143---------------*/

String getLogTime() {
  if (timeActive)  {                                                            // if time is active
    return MY_TIME_F;                                                           // return the current formatted time
  } else return String(millis());                                               // else return milliseconds since boot

}

/*---------------  CONVERT MILLISECONDS TO COMMA SEPARATED HOURS, MINUTES, AND SECONDS  ---------------*/

String msToCommaSepDHMS(unsigned long ms, char separator, bool pretty) {
  String theDHMS = "";
  String d = String(ms / 86400000);
  String h = pad(String((ms / 3600000) % 24), '0', 2);
  String m = pad(String((ms / 60000) % 60), '0', 2);
  String s = pad(String((ms / 1000) % 60), '0', 2);
  if(pretty) {
    return d + " days, " + h + ":" + m + ":" + s;
  } else return d + separator + h + separator + m + separator + s;
}

/*---------------  CONVERT MILLISECONDS TO HOURS, MINUTES, AND SECONDS  ID 107---------------*/

String msToDHMS(unsigned long ms)  {       // milliseconds to days, hours, minutes, seconds
  String d = String(ms / 86400000 );
  String h = String((ms / 3600000) % 24 );
  String m = String((ms / 60000) % 60);
  String s = String((ms / 1000) % 60);
  String theDHMS = d + " Days " + h + " Hours " + m + " Minutes " + s + " Seconds";
  return theDHMS;
}

/*---------------    INITIALIZE THE WEB SOCKET   ---------------*/

void startWebServer() {
  ws.onEvent(webSocketEvent);                                                   // set the function that will handle the incoming websockewt events
  server.addHandler(&ws);                                                       // register the websocket object on our HTTP web server. As input, this method will receive the address of our AsyncWebSocket object.
  webServerActions();                                                           // add a route to serve the HTML / JavaScript file for each page
  server.begin();                                                               // Start the web server
  mySP("Web server started.\n", FN, LN);
}

 /*---------------  REBOOT ASKED FOR  ---------------*/

void requestReboot(String reason, bool immediately) {
  mySP(reason + "\n", FN, LN);                                                  // log this
  myFileSys.writeFile(rebootReason.c_str(), reason.c_str(), LN);               // write the reboot reason to disk
  if(immediately) {
    mySP("Rebooting...\n", FN, LN);                       // log the server is rebooting now
    Serial.flush();                                       // flush the serial buffer
    ESP.restart();                                        // restart the server
  } else restartESP32();                                                               // reboot the ESP32
}


/*---------------  REBOOTS THE ESP32  ---------------*/

void restartESP32() {
  digitalWrite(DEVICE_IS_RUNNING, HIGH);                  // on-board LEDS are inverted...LOW is on, HIGH is off
  rebootAskedforAt = millis();                            // init 'rebootAskedforAt' to now
  lastRebootUpdate = rebootAskedforAt;                    // init 'lastRebootUpdate' to now
  rebooting = true;                                       // change 'rebooting' to true
  doServerRebootActions();                                // let the server do any desired reboot actions
  mySP("Restarting server 5 seconds\n", FN, LN);          // log a reboot has been started
}

/*---------------  SERVER REBOOT IN PROGRESS  ---------------*/

void serverRebootInProgress() {
  if (millis() - rebootAskedforAt > 5000)  {          // if it has been 5 seconds since the reboot was started
    mySP("Rebooting...\n", FN, LN);                   // log the server is rebooting now
    Serial.flush();                                   // flush the serial buffer
    ESP.restart();                                    // restart the server
  } else {                                            // else, still under 5 seconds
    mySP(".", "-1", LN);                              // send a '.' to the log
    lastRebootUpdate = millis();                      // update the last server reboot update time
  }
}

/*---------------  SERVER PAGE NOT FOUND  ---------------*/

void notFound(AsyncWebServerRequest *request, String appName) {
  IPAddress ip = request->client()->remoteIP();                                                   // capture the requesters ip address
  String requested_file = request->url();                                                         // capture the URL being requested
  if (requested_file.indexOf("/sendfile:")) {                                                     // if the url contains 'sendfile:' then
    requested_file = requested_file.substring(requested_file.indexOf(":") + 1);                   // strip it off
  }
  if(myFileSys.getFS().exists(requested_file)) {
    mySP("received a request for '" + requested_file + "'.\n", FN, LN);                           // log a request for a file has been received
    downloadingFile = true;                                                                       // tell the server that a download is in process
    mySP("sending web page code file '"+requested_file+"' to '"+ip.toString() + "'.\n", FN, LN);  // log what is happening
    File f = myFileSys.getFS().open(requested_file, "r");
    AsyncWebServerResponse *response = request->beginChunkedResponse("text/plain",                // begin sending the file in a chuncked response mode
    [f](uint8_t *buffer, size_t maxLen, size_t index) -> size_t {
      //Write up to "maxLen" bytes into "buffer" and return the amount written.
      //index equals the amount of bytes that have been already sent
      //You will be asked for more data until 0 is returned
      //Keep in mind that you can not delay or yield waiting for more data!
      return load_data(f, buffer, maxLen, index);
    });
    response->addHeader("Server", "ESP Async Web Server");                                        // add a header to the response message
    request->send(response);                                                                      // send the response message
  } else {                                                                                        // else this is a page not found so
    request->send(404, "text/plain", "ERROR:404 - " + appName + " says page not found.");         // tell the browser the page was not found
  }
}

