spmckeon1/EmbeddedInfrastructure/old_src/commonItems_ESP32.cpp
/*---------------  REBOOT ESP8266  ---------------*/

void restartESP() {
  mySP("Flushing serial buffers before reboot.\n", FN, LN);
  Serial.flush();                                   // flush the serial buffer
  ESP.restart();                                    // restart the server
}

/*---------------  SUBTRACT UNSIGNED LONG INTS  ---------------*/

unsigned long suli(unsigned long minuend, unsigned long subtrahend, int from, bool logErr) {
  if(subtrahend > minuend)
    if(subtrahend > minuend) {
      if(logErr)
        mySP("From: LINE " + String(from) + " 'suli' subtrahend: " + String(subtrahend) +
             "' is greater than minuend: '" + String(minuend) + "'\n", FN, LN);
      return 0;
    }
  return minuend - subtrahend;
}

/*---------------  SUBTRACT UNSIGNED LONG INTS  ---------------*  REPLACED WITH SULI

unsigned long subUnsignedLongInt(unsigned long minuend, unsigned long subtrahend) {
  if(subtrahend > minuend) return 0;
  return minuend - subtrahend;
}

  /*---------------  WHAT IS THE PINS VALUE, GET TWO OUT OF THREE SAME READINGS  ---------------*/

bool twoOfThree(int pin)  {
  int results1 = 0;
  int results0 = 0;
  if (digitalRead(pin)) {                                       // read the pin and if it is a 1
    results1 += 1;                                              // increment results1 by one
  } else results0 += 1;                                         // else put increment results0
  delay(20);                                                    // wait 20 milliseconds
  if (digitalRead(pin)) {                                       // read the pin again and if it is a 1
    results1 += 1;                                              // increment results1 by one
  } else results0 += 1;                                         // else put increment results0
  delay(20);                                                    // wait 20 milliseconds
  if (digitalRead(pin)) {                                       // read the pin again and if it is a 1
    results1 += 1;                                              // increment results1 by one
  } else results0 += 1;                                         // else put increment results0
  if (false) {                                                   // if debugging
    mySP("Best 2 out of 3: results = 1:  " + String(results1) + // log the results
         ", results = 0: " + String(results0) + "\n", FN, LN);
  }
  if (results1 > results0) {                                    // if results1 is greater than results0 then
    return true;                                                // return true
  } else {
    return false;                                              // else return false
  }
}

/*--------  DUMP TM STRUCT  --------*/

void dumpTM_struct(tmElements_t *tm) {
  Serial.println("DUMPING TM RECORD:");
  Serial.println("    Second: " + String(tm->Second));
  Serial.println("    Minute: " + String(tm->Minute));
  Serial.println("    Hour: " + String(tm->Hour));
  Serial.println("    Wday: " + String(tm->Wday));
  Serial.println("    Day: " + String(tm->Day));
  Serial.println("    Month: " + String(tm->Month));
  Serial.println("    Year: " + String(tm->Year));
}

/*--------  CONVERT TIME ELEMENTS STRUCT TO UNIX TIME SECONDS  --------*/

time_t localTimeToUNIX_secs() {
  tmElements_t tm;                                                              // define the time struct to be used
  tm.Second = SEC.toInt();                                                      // populate Seconds, Minutes, Hours Day,
  tm.Minute = MINUTE.toInt();                                                   // Month, and Year using EzTime functions to get the time
  tm.Hour = HOUR.toInt();
  tm.Day = DAY.toInt();
  tm.Month = MONTH.toInt();
  tm.Year = YEAR.toInt() - 1970;                                                // load the 'tm' struct with the year, month, and day of the file
  return makeTime(tm);                                                          // return thee time in UNIX seconds
}

  /*--------  CONVERT UNIX TIME SECONDS TO HUMAN TIME  --------*/

String unixT_toHumanT(time_t t) {
  tmElements_t tm;                      // define the time struct to be used
  pdl(FN, LN);
  pdl(FN, LN);
  breakTime(t, tm);
  return String(tm.Year + 1970) + "/" +
         String(tm.Month) + "/" +
         String(tm.Day) + " @ " +
         String(tm.Hour) + ":" +
         String(tm.Minute) + ":" +
         String(tm.Second) +
         myTZ.dateTime(t, " A T");
}

/*--------  CHECK THE HEAP  --------*/

void checkTheHeap(bool force) {
  static runTime isTimeInfo = {CK_HEAP_INTERVAL, -1, CT_MINUTE};                          // store when to run
  if(isTimeToRun(&isTimeInfo) || force) {                                                 // find out if it is time to run and if it is then
    long theHeap = ESP.getFreeHeap();                                                     // get the free heap memory
    mySP("[MAIN] Free heap: " + String(theHeap) +  ": bytes, previous free heap was: " +  // send the info to the consoles
         String(lastFreeHeap) + "\n", FN, LN);
    lastFreeHeap = theHeap;                                                               // remember what the free heap size was
  }
}

/*--------------------------------------   HANDLE CLIENT LISTS  --------------------------------------*/

/*---------------  DECREMENT A CLIENT FROM THE LIST WHEN THEY LEAVE  ID 115---------------*
   When a client leaves, decrement them from the list
*

bool decrementClientFromList(int clientNum) {
  
  int aPos = findClientIndex(clientNum, true);
  if (aPos != -1) {
    mySP("Client " + String(clientNum) + " removed from Client List. " + // log the new web page has disconnected
         ", Type :'" + connectedClients[aPos].type +
         "', IP Address:'" + connectedClients[aPos].ipAddr +
         "', CUID:'" + connectedClients[aPos].CUID +
         "'\n", FN, LN);
    numOfConnectedClients --;                                             // decrement the number of connected clients
    connectedClients[aPos].id = 0;                                        // erase the old clients num
    connectedClients[aPos].ipAddr = "";                                   // and ip address
    connectedClients[aPos].type = "";                                     // and type
    connectedClients[aPos].CUID = "";                                     // and type
    clientIdsInUse[aPos] = 0;                                             // tell clientIdsInUse this ID is no longer in use
    return true;
  } else {                                                                  // else failed to fimd the record
    printListOfConnectedClients();
    mySP("ERROR 102: Failed to delete client id:'" + String(clientNum) +  // log this info
         "'s connectedClients record. Please report this to the developer.\n"
         , FN, LN);
    return false;
  }
}

/*---------------  ADD A NEW CLIENT TO THE LIST  ---------------*

