spmckeon1/EmbeddedInfrastructure/old_src/commonItems_ESP32.cpp
bool addNewClientToList(AsyncWebSocketClient * client, String type, String CUID)  {
  int aPos = getUnusedClientIndex();                                  // get the first unused array position
  if (aPos == -1)  {
    sendWS_msg(FN, "ERROR 101:To many clients are connected.  Please try later.", client);
    return false;
  }
  numOfConnectedClients ++;                                       // increment the number of connected clients
  connectedClients[aPos].id = (int)client->id();                  // remember the websocket assigned client number
  connectedClients[aPos].ipAddr = client->remoteIP().toString();  // remember its ip address.
  connectedClients[aPos].type = type;                             // type of web page, main, wifi
  connectedClients[aPos].CUID = CUID;                             // record the clients unique id
  connectedClients[aPos].logTail = false;                         // record the client is not tailing a file
  connectedClients[aPos].client = client;                         // record the clients 'client' object
  clientIdsInUse[aPos] = 1;                                       // update the array of connected client IDs in use
  return true;
}

/*---------------  PRINT A LIST OF THE CONNECTED CLIENTS  ID 116---------------*
   returns a list of all the connected clients (web pages)
*

String printListOfConnectedClients() {
  if (false) {
    mySP("In printListOfConnectedClients()\n", FN, LN);
  }
  String s = "";
  for (int i = 0; i < MAX_NUM_CONNECTED_CLIENTS; i++)  {        // for each possible connected client
    s = s + String(clientIdsInUse[i]) + ",";                    // assemble an array of the clients in use
  }
  s = s.substring(0, s.lastIndexOf(","));                       // delete the last comma
  s = "ClientIdsInUse: " + s + "\n";                            // put this into 's'
  for (int i = 0; i < MAX_NUM_CONNECTED_CLIENTS; i++)  {        // for each possible client
    if (clientIdsInUse[i]) {                                    // if the array index is in use
      s += "  Client num: " +                                   // add the information on it to 's'
           String(connectedClients[i].id) +
           ", " + connectedClients[i].type +
           ", IP Address: " + connectedClients[i].ipAddr +
           ", CUID: " + connectedClients[i].CUID +
           ", tail log: " + connectedClients[i].logTail +
           ", client->id = " + (connectedClients[i].client ? String(connectedClients[i].client->id()) : "Not in use") + "\n";
    }
  }
  //  mySP(s, FN, LN);                                             // log 's'
  s = s + "\n";
  return s;                                                // return 's' to the calling function
}

/*---------------  GET AN UNUSED POSITION IN clientIdsInUse ARRAY  ID 117---------------*

int getUnusedClientIndex() {
  for (int i = 0; i < MAX_NUM_CONNECTED_CLIENTS; i++) {   // for each avaiable position in the clientIdsInUse
    if (clientIdsInUse[i] == 0) return i;                 // if the position is unused, return 'i'
  }
  return -1;                                              // if an unused one was not foound then MAX_NUM_CONNECTED_CLIENTS are connected
}

/*---------------  FIND CLIENTS BY TYPE ---------------*

String findClientsByType(String type) {
  String s = "";
  for (int i = 0; i < MAX_NUM_CONNECTED_CLIENTS; i++) {   // for each avaiable position in the clientIdsInUse
    if(connectedClients[i].type == type) {
      s += "1";
    } else s += "0";
  }
  return s;
}


/*---------------  FIND A CLIENTS clientIdsInUse ARRAY POSITION  ID 118---------------*

int findClientIndex(int id, bool logErr) {
  for (int i = 0; i < MAX_NUM_CONNECTED_CLIENTS; i++) {                                                           // for each avaiable position in the clientIdsInUse
    if (connectedClients[i].id == id) return i;                                                                   // if this is the right one then return i
  }
  if (logErr) {                                                                                                   // if this error is not expected
    mySP("ERROR 103: Failed to locate the connectedClients record for client id: " + String(id) + "\n", FN, LN);  // log it
    printListOfConnectedClients();                                                                                // print the list of connected clients
  }
  return -1;                                                                                                      // failed to find id, return -1
}

/*---------------  FIND A CLIENTS BY CUID  ID 121---------------*

int findClientByCUID(String CUID, bool adviseOnResults) {
  for (int i = 0; i < MAX_NUM_CONNECTED_CLIENTS; i++) {   // for each avaiable position in the clientIdsInUse
    if (connectedClients[i].CUID == CUID) {
      mySP("Client CUID: " + CUID + " found.  Client id is " + String(connectedClients[i].id) + "\n", FN, LN);
      return i;        // if this is the right one then return i
    }
  }
  if (adviseOnResults) {
    mySP("ERROR 104: Failed to locate by CUID the connectedClients record for client id: " + CUID + "\n", FN, LN);
  }
  return -1;                                            // failed to find id, return -1
}

/*---------------  GATHER WIFI SETUP DATA  ---------------*/

 void gatherWiFiSetupData(String &jsonOutput, MQTT_hostPtr mqttPtr) {
   // Allocate our clean ArduinoJson v7 document
   JsonDocument doc;

   // 1. Pack Wi-Fi Data Keys straight from your live 'logInD1' struct
   doc["ssid"]       = logInD1.ssid;
   doc["pass"]       = logInD1.ssidPwd;
   doc["tz"]         = logInD1.tzAbbrv;
   doc["olson"]      = logInD1.olsenTzName;
   doc["posix"]      = logInD1.posixTzRule;

   // 2. Pack MQTT Data Keys straight from your 'mqttPtr' struct
   doc["mqttServer"] = mqttPtr->host.toString();
   doc["mqttPort"]   = mqttPtr->portNo;
   doc["mqttUser"]   = mqttPtr->brokerUser;
   doc["mqttPass"]   = mqttPtr->brokerPwd;

   // 3. Serialize the object directly into a safe local buffer (No fragmentation)
   char buffer[256];
   serializeJson(doc, buffer, sizeof(buffer));

   // Drop the finished text directly into your passed-in variable
   jsonOutput = buffer;
 }
 
/*---------------  GATHER WIFI SETUP DATA  ---------------*

String gatherWiFiSetupData(MQTT_hostPtr mqttPtr) {
  return logInD1.ssid + "|" +                                                   // assemble and return the data required for
         logInD1.ssidPwd + "|" +                                                // initing the WiFi setup page
         mqttPtr->host.toString() + "|" +
         String(mqttPtr->portNo) + "|" +
         mqttPtr->brokerUser + "|" +
         mqttPtr->brokerPwd;
}

/*---------------    HANDLE A NEW WIFI SETUP WEB PAGE   ---------------*/

void initNewWiFiPg(String s, AsyncWebSocketClient *client, const_dataPtr constDataPtr, MQTT_hostPtr mqttPtr) {
  String outboundData = "";
  String CUID = s.substring(s.lastIndexOf(":") + 1);                                              // split the clients UID out of the string
  String ip = client->remoteIP().toString();                                                      // get its IP address
  mySP("A new WiFi setup web page has joined.  ClientId:'"+String(client->id())+                  // log the new web page that joined
              "', Type :'WiFi setup', IP Address:'"+ip+"', CUID:'"+CUID+"'\n", FN, LN);
  sendWS_msg(FN, "serverip:" + srvIPAddr, client);                                                // send the client the servers ip address
  sendWS_msg(FN, "clientip:" + ip, client);                                                       // send the client its ip address
  sendWS_msg(FN, "pgHeader:" + constDataPtr->pageHeader, client);                                 // send the page header
  sendWS_msg(FN, "listDir:" + myFileSys.readFile(allDirectoriesToFile.c_str(), true), client);
  gatherWiFiSetupData(outboundData, mqttPtr);
  sendWS_msg(FN, "initWebDataJSON:" + outboundData, client);                                      // send the web page the info needed to setup the data fields
 }

/*---------------    HANDLE GETTING THE WIFI SETUP WEB PAGE   ---------------*/

void hdlWiFiSetupEvent(String s, AsyncWebSocketClient *client, MQTT_hostPtr mqttHostPtr, LogInData_Ptr logInDataPtr) {
  if(true) mySP("Incoming string: " + s + "\n", FN, LN);
  
