spmckeon1/EmbeddedInfrastructure/old_src/commonItems_ESP32.cpp
  // 📡 ROUTE 1: Modern JSON Payload Handler
  if(s.indexOf("cfgDataJSON:") != -1) {
    
    // Fix: Cut right after the final colon, isolating pure curly brackets {...}
    int jsonStartPos = s.indexOf("cfgDataJSON:") + 12;
    String jsonPayload = s.substring(jsonStartPos);
    mySP("Isolated JSON Text Block: '" + jsonPayload + "'\n", FN, LN);
    
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, jsonPayload);
    
    if (error) {
      mySP("ERROR: Web form JSON parsing failed! Reason: " + String(error.c_str()) + "\n", FN, LN);
      return;
    }
    
    // Keys extract straight to memory parameters dynamically
    // ✅ Modernized and routed to the correct pointers!
    if (doc["ssid"].is<String>())       logInDataPtr->ssid       = doc["ssid"].as<String>();
    if (doc["pass"].is<String>())       logInDataPtr->ssidPwd    = doc["pass"].as<String>();
    if (doc["mqttServer"].is<String>()) mqttHostPtr->host.fromString(doc["mqttServer"].as<String>());
    if (doc["mqttPort"].is<int>())      mqttHostPtr->portNo      = doc["mqttPort"].as<int>();
    
    // Fixed: Routed to mqttHostPtr instead of logInDataPtr!
    if (doc["mqttUser"].is<String>())   mqttHostPtr->brokerUser  = doc["mqttUser"].as<String>();
    if (doc["mqttPass"].is<String>())   mqttHostPtr->brokerPwd   = doc["mqttPass"].as<String>();

    // Automatically sanitize strings using .trim() for absolute boot security
    logInDataPtr->ssid.trim();
    logInDataPtr->ssidPwd.trim();
    
    // Commit the fresh settings instantly to their proper dedicated storage files
    mySP("Writing new credentials to storage disks...\n", FN, LN);
    writeNetInfoToDisk(netInfoFname);
    writeMqttDataToDisk(mqttHostPtr, mqttInfoFname, LN);
    
    mySP("SUCCESS: Web configuration successfully saved via unified JSON layout!\n", FN, LN);
    return; // Exits cleanly!
  }
  static String path = "";
  if (s.indexOf("incomingFile") != -1) {
    String ts = s.substring(0, 25);
    if (ts.indexOf("incomingFileComplete") != -1) {
      Serial.println("file download is complete.");
      mySP("Downloaded '" + path + "' - '" + String(myFileSys.getFileSize(path.c_str())) +
           " bytes\n", FN, LN);
      path = "";
    } else {
      path = s.substring(s.indexOf(":") + 1, s.indexOf("|"));
      myFileSys.appendFile(path.c_str(), (s.substring(s.indexOf("|") + 1)).c_str());
      return;
    }
  }
  if (s.indexOf("downloadLocation:") != -1) {
    downloadLoc = s.substring(s.lastIndexOf(":") + 1);
    mySP("Download location  = '" + downloadLoc + "'\n", FN, LN);
    sendWS_msg(FN, "DownLoadLocRec:" + downloadLoc, client);
  }
  if (s.indexOf("fileSizePlease:") != -1) {
    client->text("requestedFileSizeIs:" + myFileSys.getFileSize(path.c_str()));
  }
}

/*---------------  GET REBOOT REASON  ---------------*/

void getBootReasonMessage(char *buffer, int bufferlength) {
  #if defined(ARDUINO_ARCH_ESP32)
    esp_reset_reason_t reset_reason = esp_reset_reason();
    switch (reset_reason) {
      case ESP_RST_UNKNOWN:
        snprintf(buffer, bufferlength, "Reset reason can not be determined" + '\0');
        break;
      case ESP_RST_POWERON:
        snprintf(buffer, bufferlength, "Reset due to power-on event" + '\0');
        break;
      case ESP_RST_EXT:
        snprintf(buffer, bufferlength, "Reset by external pin (not applicable for ESP32)" + '\0');
        break;
      case ESP_RST_SW:
        snprintf(buffer, bufferlength, "Software reset via esp_restart" + '\0');
        break;
      case ESP_RST_PANIC:
        snprintf(buffer, bufferlength, "Software reset due to exception/panic" + '\0');
        break;
      case ESP_RST_INT_WDT:
        snprintf(buffer, bufferlength, "Reset (software or hardware) due to interrupt watchdog" + '\0');
        break;
      case ESP_RST_TASK_WDT:
        snprintf(buffer, bufferlength, "Reset due to task watchdog" + '\0');
        break;
      case ESP_RST_WDT:
        snprintf(buffer, bufferlength, "Reset due to other watchdogs" + '\0');
        break;
      case ESP_RST_DEEPSLEEP:
        snprintf(buffer, bufferlength, "Reset after exiting deep sleep mode" + '\0');
        break;
      case ESP_RST_BROWNOUT:
        snprintf(buffer, bufferlength, "Brownout reset (software or hardware)" + '\0');
        break;
      case ESP_RST_SDIO:
        snprintf(buffer, bufferlength, "Reset over printListOfConnectedClientsIO" + '\0');
        break;
    }
    if (reset_reason == ESP_RST_DEEPSLEEP) {
      esp_sleep_wakeup_cause_t wakeup_reason = esp_sleep_get_wakeup_cause();
      switch (wakeup_reason) {
        case ESP_SLEEP_WAKEUP_UNDEFINED:
          snprintf(buffer, bufferlength, "In case of deep sleep: reset was not caused by exit from deep sleep" + '\0');
          break;
        case ESP_SLEEP_WAKEUP_ALL:
          snprintf(buffer, bufferlength, "Not a wakeup cause: used to disable all wakeup sources with esp_sleep_disable_wakeup_source" + '\0');
          break;
        case ESP_SLEEP_WAKEUP_EXT0:
          snprintf(buffer, bufferlength, "Wakeup caused by external signal using RTC_IO" + '\0');
          break;
        case ESP_SLEEP_WAKEUP_EXT1:
          snprintf(buffer, bufferlength, "Wakeup caused by external signal using RTC_CNTL" + '\0');
          break;
        case ESP_SLEEP_WAKEUP_TIMER:
          snprintf(buffer, bufferlength, "Wakeup caused by timer" + '\0');
          break;
        case ESP_SLEEP_WAKEUP_TOUCHPAD:
          snprintf(buffer, bufferlength, "Wakeup caused by touchpad" + '\0');
          break;
        case ESP_SLEEP_WAKEUP_ULP:
          snprintf(buffer, bufferlength, "Wakeup caused by ULP program" + '\0');
          break;
        case ESP_SLEEP_WAKEUP_GPIO:
          snprintf(buffer, bufferlength, "Wakeup caused by GPIO (light sleep only)" + '\0');
          break;
        case ESP_SLEEP_WAKEUP_UART:
          snprintf(buffer, bufferlength, "Wakeup caused by UART (light sleep only)" + '\0');
          break;
        default :
          snprintf(buffer, bufferlength, "Unknown reset reason %d", reset_reason);
          break;
      }
    }
  #endif
  #if defined(ARDUINO_ARCH_ESP8266)
    rst_info *resetInfo;
    resetInfo = ESP.getResetInfoPtr();
    switch (resetInfo->reason) {
      case REASON_DEFAULT_RST:
        snprintf(buffer, bufferlength, "Normal startup by power on" + '\0');
        break;
      case REASON_WDT_RST:
        snprintf(buffer, bufferlength, "Hardware watch dog reset" + '\0');
        break;
      case REASON_EXCEPTION_RST:
        snprintf(buffer, bufferlength, "Exception reset, GPIO status won't change" + '\0');
        break;
      case REASON_SOFT_WDT_RST:
        snprintf(buffer, bufferlength, "Software watch dog reset, GPIO status won't change" + '\0');
        break;
      case REASON_SOFT_RESTART:
        snprintf(buffer, bufferlength, "Software restart ,system_restart , GPIO status won't change" + '\0');
        break;
      case REASON_DEEP_SLEEP_AWAKE:
        snprintf(buffer, bufferlength, "Wake up from deep-sleep" + '\0');
        break;
      case REASON_EXT_SYS_RST:
        snprintf(buffer, bufferlength, "External system reset" + '\0');
        break;
      default:
        snprintf(buffer, bufferlength, "Unknown reset cause %d", resetInfo->reason);
        break;
  };
  #endif
}

/*---------------  SERVER FILE NOT FOUND  ---------------*/

void fileNotFound(AsyncWebServerRequest *request, const_dataPtr cdp) {
  request->send(404, "text/plain", "ERROR:404 - " + String(cdp->appName) + " says page not found.");      // tell the requesting browser the page was not found
}


/*---------------  SERVER PAGE NOT FOUND AND CHECKING TO SEE IF FILE EXISTS ON SERVER  ---------------*/

