spmckeon1/EmbeddedInfrastructure/old_src/commonItems_ESP32.cpp
void sendFileIfPresent(AsyncWebServerRequest *request, const_dataPtr cdp) {
  IPAddress ip = request->client()->remoteIP();                                                       // capture the requesters ip address
  String requested_file = request->url();                                                             // capture the URL being requested
  if(requested_file.indexOf("/api/2W") == -1) {                                                       // if the request does not contain "/api/2W"
    mySP("received a request for '" + requested_file + "' from '" + ip.toString() + "'.\n", FN, LN);  // log a request for a file has been received
  }
  if (requested_file.indexOf("/sendfile:")) {                                                         // if the url contains 'sendfile:' then
    requested_file = requested_file.substring(requested_file.indexOf(":") + 1);                       // strip it off
  }
  if (myFileSys.getFS().exists(requested_file)) {                                                             // if the url requested is the same as a file on this server's disk
    downloadingFile = true;                                                                           // tell the server that a download is in process
    mySP("sending web page code file '"+requested_file+"' to '"+ip.toString() + "'.\n", FN, LN);      // log what is happening
    File f = myFileSys.getFS().open(requested_file, FILE_READ);                                               // open the file
    AsyncWebServerResponse *response = request->beginChunkedResponse("text/plain",                    // begin sending the file in a chuncked response mode
                                  [f](uint8_t *buffer, size_t maxLen, size_t index) -> size_t {
      //Write up to "maxLen" bytes into "buffer" and return the amount written.
      //index equals the amount of bytes that have been already sent
      //You will be asked for more data until 0 is returned
      //Keep in mind that you can not delay or yield waiting for more data!
      return myFileSys.load_data(f, buffer, maxLen, index);                                                       // load the next maxlen btes of the file into the buffer
    });
    response->addHeader("Server", "ESP Async Web Server");                                              // add a header to the response message
    request->send(response);                                                                            // send the response message
  } else {                                                                                              // else this is a page not found so
    fileNotFound(request, cdp);
  }
}

/*--------------- UPLOADS THE FILE (REPLACES IT) VIA A WIFI CONNECTION ---------------*/

void handlePostFile(AsyncWebServerRequest *request, const String& filename, size_t index, uint8_t *data, size_t len, bool final) {
  static File file;
  if(false) {
    mySP("Received a POST request from: " + request->url(), FN, LN);
    mySP("request->url: " + request->url() + "\n", FN, LN);
    mySP("request->contentLength(): " + String(request->contentLength()) + "\n", FN, LN);
    mySP("filename: " + filename + "\n", FN, LN);
    mySP("index: " + String(index) + "\n", FN, LN);
    mySP("len: " + String(len) + "\n", FN, LN);
    mySP("final: " + String(final?"Yes":"No") + "\n", FN, LN);
  }
  String fname = downloadLoc + "/" + filename;
  if (index == 0) {                                                                     // if this is the first pass through
    downloadingFile = true;                                                             // let all the parts of the system know a download has been started
    myFileSys.deleteFile((fname).c_str(), LN);                                         // delete the existing file
    mySP("Downloading " + filename + " and putting it into " + fname + "\n", FN, LN);   // log the action
    file = myFileSys.getFS().open((fname).c_str(), FILE_WRITE);                                 // open the file
  }
  if (!file) {                                                                  // if it failed to be opened
    mySP(getLogTime() + ",Failed to open file '" + fname                        // log the error
                + "' for appending.\n", FN, LN);
  }
  if (!file.write(data, len)) {                                                 // write the data to the file and if written bytes are zero
    mySP("Append failed to file'" + fname + "'\n", FN, LN);                     // log the data was not successfully written
  }
  if (final) {                                                                  // if this is the last pass through then
    downloadingFile = false;                                                    // let all the parts f the system know the download is complete
    file.close();                                                               //  close the file
    mySP("Download of '" + fname + "' is complete. File size is: "              // log the transfer is complete
         + String(myFileSys.getFileSize(fname.c_str())) + "\n", FN, LN);
    request->send(200);                                                         // send an okay back to the sending web page
  }
}

/*---------------    GLOBAL CONFIGURATION CHANGE   ---------------*/

void gblCfgChg(String data, MQTT_hostPtr mhp) {
  const int EXPECTED_COUNT = 10;
  String oldTzAbbrv = logInD1.tzAbbrv;
  String oldOlsename = logInD1.olsenTzName;                                   // extract the individual fields and save them to the appropiate place
  enum gcc {GCC_SSID,                                       // GCC = global configuration change
            GCC_SSID_PWD, 
            GCC_MQTT_SERVER_NAME,
            GCC_MQTT_SERVER_PORT_NUM,
            GCC_MQTT_BROKER_NAME,
            GCC_MQTT_BROKER_PWD,
            GCC_TZ_ABBREV,
            GCC_TZ_OLSEN_NAME
  };
  int actCnt = numOfCharInStr(data, '|') + 1 ;                                        // actCnt (actual count) the number of fields in the incoming string
  if(actCnt != EXPECTED_COUNT) {                                                      // if the number of items is not the expected count then
    mySP("Received an inbound Global Cfg change MQTT nessage with " + String(actCnt)  // log the issue
       + " items instead of the expected " + String(EXPECTED_COUNT) 
       + " items.  Aborting receive.\n", FN, LN);
    mySP("Received an inbound Global Cfg change MQTT nessage:" + data + "\n", FN, LN);
    return;                                                                           // and return to the calling function (ABORT CFG CHANGE)
  }
  String arr[actCnt];                                                                 // create an array for each of the fields
  int count = strToArray(data, '|', actCnt, arr);                                    // split the string into the array 'arr'
  if(true) {                                                                          // if debugging
    mySP("Planning in receiving " + String(actCnt) + " elements.\n", FN, LN);         // log the planned actCnt on cfg items to be received
    mySP("Incoming cfg data has " + String(count) + " elements.\n", FN, LN);          // log the count of elements strToArray found
  }
  logInD1.ssid = arr[GCC_SSID];
  logInD1.ssidPwd = arr[GCC_SSID_PWD];
  mhp->host.fromString(arr[GCC_MQTT_SERVER_NAME]);
  mhp->portNo  = arr[GCC_MQTT_SERVER_PORT_NUM].toInt();
  mhp->brokerUser = arr[GCC_MQTT_BROKER_NAME];
  mhp->brokerPwd = arr[GCC_MQTT_BROKER_PWD];
  logInD1.tzAbbrv = arr[GCC_TZ_ABBREV];
  logInD1.olsenTzName = arr[GCC_TZ_OLSEN_NAME];
  saveCfgChgs();                                                                      // sane the configuration changes to disk
  if(oldOlsename != logInD1.olsenTzName || oldTzAbbrv != logInD1.tzAbbrv) {           // if the tz has changed then
    tzChange = true;                                                                  // cause the re-sync of EzTime
  }
}

/*---------------    GLOBAL CONFIGURATION CHANGE (JSON VERSION)   ---------------*/

void gblCfgChgJson(String jsonStr, MQTT_hostPtr mhp) {
  // 1. Allocate memory for parsing the incoming JSON payload string
  JsonDocument doc;
  
  // 2. Deserialize the JSON string
  DeserializationError error = deserializeJson(doc, jsonStr);
  
  if (error) {
    mySP("JSON Deserialization failed: " + String(error.c_str()) + "\n", FN, LN);
    mySP("Received invalid JSON payload: " + jsonStr + "\n", FN, LN);
    return; // Abort if string is corrupted or poorly formatted
  }
  
  // 3. Stash your historical settings to check for changes at the end
  String oldTzAbbrv   = logInD1.tzAbbrv;
  String oldOlsename  = logInD1.olsenTzName;
  
  if(true) { // If debugging, print confirmation
    mySP("Successfully received valid JSON configuration payload.\n", FN, LN);
  }
  
