spmckeon1/EmbeddedInfrastructure/old_src/commonItems_ESP32.cpp
  // 4. Extract parameters directly out of the JSON object keys using v7 compliance
  if (doc["ssid"].is<String>())   logInD1.ssid    = doc["ssid"].as<String>();
  if (doc["pass"].is<String>())   logInD1.ssidPwd = doc["pass"].as<String>();
  
  if (!doc["broker"].isNull()) {
    mhp->host.fromString(doc["broker"].as<String>());
  }
  
  if (!doc["port"].isNull()) {
    mhp->portNo = doc["port"].as<int>();
  }
  
  if (doc["user"].is<String>())   mhp->brokerUser = doc["user"].as<String>();
  if (doc["pwd"].is<String>())    mhp->brokerPwd  = doc["pwd"].as<String>();
  if (doc["tz"].is<String>())     logInD1.tzAbbrv = doc["tz"].as<String>();
  
  // Fallback checks to catch both 'olsen' and 'olson' spellings out of Node-RED
  if (!doc["olsen"].isNull()) {
    logInD1.olsenTzName = doc["olsen"].as<String>();
  } else if (!doc["olson"].isNull()) {
    logInD1.olsenTzName = doc["olson"].as<String>();
  }
  
  // ==========================================
  // 5. EXTRACT AND COMMIT THE NEW POSIX RULE
  // ==========================================
  if (!doc["posix"].isNull()) {
    logInD1.posixTzRule = doc["posix"].as<String>();
    
    // Proactively apply this rule to the ESP32 internal environment clock engine right now!
    setenv("TZ", logInD1.posixTzRule.c_str(), 1);
    tzset();
    mySP("Applied new POSIX Timezone Rule string to ESP32 core clock: " + logInD1.posixTzRule + "\n", FN, LN);
  }
  
  // 6. Commit the updated struct to flash/disk memory on the chip
  saveCfgChgs();
  
  // 7. Fire the ezTime re-sync flag if environmental constraints shifted
  if(oldOlsename != logInD1.olsenTzName || oldTzAbbrv != logInD1.tzAbbrv) {
    tzChange = true;
  }
  // ==========================================
  // 💾 NEW CONCLUSION LOGGING BLOCKS
  // ==========================================
  if(true) {
    mySP("\n--- gblCfgChgJson Conclusion Variable Verification ---\n", FN, LN);
    mySP("Stored Wi-Fi SSID  : " + logInD1.ssid + "\n", FN, LN);
    mySP("Stored Wi-Fi Pass  : [Masked]\n", FN, LN);
    mySP("MQTT Host Address  : " + mhp->host.toString() + "\n", FN, LN);
    mySP("MQTT Target Port   : " + String(mhp->portNo) + "\n", FN, LN);
    mySP("MQTT Broker User   : " + mhp->brokerUser + "\n", FN, LN);
    mySP("MQTT Broker Pass   : [Masked]\n", FN, LN);
    mySP("Timezone Abbrev    : " + logInD1.tzAbbrv + "\n", FN, LN);
    mySP("Olsen Timezone Name: " + logInD1.olsenTzName + "\n", FN, LN);
    mySP("POSIX Clock Rule   : " + logInD1.posixTzRule + "\n", FN, LN);
    mySP("------------------------------------------------------\n\n", FN, LN);
  }
}

/*---------------    CONVERT UNSIGNED LONG TO STRING   ---------------*/
  
String ults(unsigned long x) {                                                  // Unsigned long to String
  char str[33];
  sprintf(str, "%lu",  x);
  return(String(str));
}

/*---------------    GENERATE APP DATA INFO FOR WEB PAGES   ---------------*/

String generateAppData(String appName, String fname, String compileDate) {
  String theVer = fname.substring(fname.lastIndexOf("_v") + 2, fname.length() - 4);
  return  "\n  " + appName + " Version: " + theVer + "\n"
          "    by Stephen McKeon\n"
          "    Compiled: " + String(compileDate) + "\n    " + fname + "\n"
          "    Uptime: " + getServerUptime() + "\n" +
          "    IP address: " + WiFi.localIP().toString() + "\n";
}

/*--------------- UNIVERSAL STRING WRAPPER FACTORY ---------------*/

String makeDefaultStr(void (*workerFunction)(String &)) {
  String tempContainer;
  workerFunction(tempContainer); // 1. Jumps directly to the address you passed
  return tempContainer;          // 2. Passes the filled string back
}
